clear, clc;

%1 ввод с клавиатуры
v =  [6 3];
%input('vector-stroka:');
w = [3 4];
%input('vector-stplbec:');
m = [2 3; 5 6];
%input('matrica:');

%2 генерация матриц специального вида
m0 = zeros(2);
m1 = ones(2);
mr = rand(2);
me = diag([1,1]);

%3 вычисление матрицы по формуле
M = m.*mr+100;
%disp(M);

%4 применение функций для обработки данных
M_size = [size(M, 1), size(M, 2)];
M_max = max(max(M));
M_min = min(min(M));
M_sum = sum(sum(M));
M_prod = prod(prod(M));

A = [ 5.5577 3.1121 8.5322 1.2649 0.3179 2.3806 0.6724; 2.6287 0.8913 1.8364 30.3882 3.4777 3.3664 6.028;7.0923 1.2885 2.3576 6.0922 4.1388 2.9021 8.1857;2.3959 0.1863 0.4417 2.1104 2.5111 0.3615 2.9413;0.4207 0.5489 0.4693 9.7843 0.5146 0.8183 2.9543;2.8124 2.2652 2.2507 4.4427 5.0705 0.3707 2.1769;4.1257 1.3867 0.7189 3.3453 2.0308 2.3465 0.0931];
C = [ 0.8762 0.7726 0.7582 0.8002 0.7962;0.3556 0.6205 0.9317 0.8679 0.871;0.3556 0.6205 0.9317 0.8679 0.871 ];

%5 вывод матрицы A
disp('A:');
disp(A);

%6 выделение из матрицы A 
B = A(2:3, 2:3);

B1 = A(1:6, 1:4);

disp('B:');
disp(B);
disp('B1:');
disp(B1);

%7 умножение матрицы с точкой и без точки
%B_1 = C.*B1;
%B_2 = C*B1;

%8 разделение матрицы левым делением с точкой и без точки
%B_3 = B.'\A;
%B_4 = A\B;

%9 транспонирование матрицы
A = A.';
